[
    {
        "user": "Speaker 0",
        "text": "The Uniparty is trying to do everything that they can to stop my candidacy, to rig the election in Colorado. And, you know, this is breaking news as of yesterday. Ken Buck's announcement yesterday was a gift to the unit party. The establishment concocted a swampy backroom deal to try to rig an election. An election that I'm winning by 20 5 points, forcing an unnecessary special election.",
        "start_time": 80,
        "end_time": 32364
    },
    {
        "user": "Speaker 0",
        "text": "When? The same day as the primary election in Colorado. And this will confuse voters, and it will re result in a lame duck congressman on day 1 and leave the 4th district with no representation for more than 3 months. This is absolutely unacceptable. I believe that this is selfish.",
        "start_time": 32905,
        "end_time": 53975
    },
    {
        "user": "Speaker 1",
        "text": "We've got yet another update with massive implications for Lauren Boebert's future in Congress. She's just announced that she would not be resigning to run-in a special election to fill Ken Buck's seat in the 4th congressional district in Colorado. So here's the quick explainer. Buck had announced that he wouldn't run for reelection next cycle. But this week, suddenly, he announced that his last day in congress would be March 22, 2024, so next week.",
        "start_time": 54355,
        "end_time": 76200
    },
    {
        "user": "Speaker 1",
        "text": "Now Ken Bach represents Colorado's 4th congressional district. Lauren Boebert represents Colorado's 3rd congressional district. But Boebert's race last cycle was super close. She only won by about 500 votes, and so she decided that she would have a better shot at winning in the 4th congressional district. But thanks to Buck's announced sudden departure, now there will be a special election to fill his seat.",
        "start_time": 76420,
        "end_time": 98185
    },
    {
        "user": "Speaker 1",
        "text": "And since Boebert isn't running in that special, a different Republican candidate for the special election will be chosen by a vacancy committee, meaning that she'll eventually be going up against whoever wins that special election, and that person will be a new incumbent congressperson with all of the advantages of the incumbency. And clearly, Ken Buck knew that. Of course, when it comes to why Lauren Boebert changed districts, the fact that she was likely to lose wasn't included in her explanation.",
        "start_time": 98185,
        "end_time": 123440
    },
    {
        "user": "Speaker 0",
        "text": "You know, this is question that I get asked all the time and I I have, no no problem answering it. He says, what was your main reason for changing districts? Now a lot of this was a personal decision in my first announcement to change districts. I I said that this, was better for me and my family personally. It's it's no secret that we have had some troubles at home and, it I went through a turbulent divorce and unfortunately, things just continued to escalate.",
        "start_time": 124060,
        "end_time": 153460
    },
    {
        "user": "Speaker 0",
        "text": "And this is a great fresh start for my family and I. So we have moved to the northeast part of Colorado and it's wonderful. The community has been so welcoming to me and my boys and we are making our house a home together. And, there's so much peace and joy and laughter playing UNO till 11 o'clock midnight with my boys just about every night. They campaign with me.",
        "start_time": 153840,
        "end_time": 175780
    },
    {
        "user": "Speaker 0",
        "text": "I'm home and cooking dinners with them and it's it's beautiful.",
        "start_time": 175955,
        "end_time": 178615
    },
    {
        "user": "Speaker 1",
        "text": "Now to be clear, that's a lie. She only beat Adam Frisch again by just over 500 votes in 2022 and with increased name ID, increased money, and increased attention on that race, Lauren Boebert knew that she was gonna lose to Adam Fish. And so she switched because why earn more votes when you can just figure out a way around it? Sound familiar? Now let's be clear, Buck did this on purpose.",
        "start_time": 178915,
        "end_time": 201570
    },
    {
        "user": "Speaker 1",
        "text": "Buck has made it clear on numerous occasions that he's not on board with what his own party has become, which is evidenced with clips like this.",
        "start_time": 201570,
        "end_time": 208675
    },
    {
        "user": "Speaker 2",
        "text": "There are a lot of things that, went into the decision, but, really were at a time in American politics that, I am not going to lie on behalf of my presidential candidate, on behalf of my party, and, I'm I'm very sad that that others in my party have taken the position that as long as we get the White House, it's it doesn't really matter what we say. Instead of having decorum, instead of, operating in a professional manner, this place has just evolved into this bickering and and nonsense and not not really doing the job for the American people.",
        "start_time": 208915,
        "end_time": 241584
    },
    {
        "user": "Speaker 3",
        "text": "How much, of the fact that you are, leaving March 22nd, next Friday, How much does that have to do with, the fact that Trump is the presumptive nominee and you're not exactly a fan?",
        "start_time": 241724,
        "end_time": 253720
    },
    {
        "user": "Speaker 2",
        "text": "Well, I don't think, whether he was a nominee or not, I I think our system is broken in in how we choose candidates, and I wanna get involved in that process.",
        "start_time": 254100,
        "end_time": 261625
    },
    {
        "user": "Speaker 1",
        "text": "And so it's easy to see just how disgusted Ken Buck has become with his own party and their inability to have a single original thought that hasn't first been approved by their god king, Donald Trump. And no one embodies that fealty more than Lauren Boebert, meaning it shouldn't come as a surprise that Buck would do whatever was in his power to ensure that Boebert wouldn't be able to take his seat. And because the right wing media ecosystem is just as servile to Donald Trump as the rest of them are, here is how they're reacting.",
        "start_time": 261685,
        "end_time": 287520
    },
    {
        "user": "Speaker 4",
        "text": "But Ken Buck earlier today announced he's resigning effective next week. It's kinda I think to screw Lauren Barber because as a senior congressman, I don't think she can run-in a special election. There has to be a special election on Colorado. So that would jack the name recognition of her, of her, opponents, and one of those will run as, an incumbent.",
        "start_time": 287814,
        "end_time": 304690
    },
    {
        "user": "Speaker 5",
        "text": "Lauren Boebert, who's been pretty good to the conservative movement. I've had her on my show. I like Lauren Boebert. Lauren Boebert is moving districts to run-in where? Follow me here.",
        "start_time": 304750,
        "end_time": 316319
    },
    {
        "user": "Speaker 5",
        "text": "The 4th. But, Dan, that's the district Ken Buck is now leaving his seat in. Yes. So what does that have to do with Lauren Boebert? The establishment doesn't like Lauren Boebert.",
        "start_time": 316860,
        "end_time": 328145
    },
    {
        "user": "Speaker 5",
        "text": "Matter of fact, they hate Lauren Boebert. Lauren Boebert's been a pretty good ally to president Trump. You've so, conveniently, the election, which has to be held folks in the chat, if I'm losing you and Joe, if I'm losing you, stop me. The primary for the new 4th congressional district. Right?",
        "start_time": 328205,
        "end_time": 350030
    },
    {
        "user": "Speaker 5",
        "text": "The primary that Lauren Bobert is in because she's moving districts now is likely going to be right around the same time, maybe the same day as the election special election to replace Ken Buck. But, damn, that means Lauren Bobert can't run-in both. She can't be the general election special election candidate to replace Buck and then be the primary candidate for the November election for congress in 4th because she'd have to leave her seat to run-in a special. Yes. Damn, that sounds like they're trying to ice Lauren Boebert out of the seat.",
        "start_time": 350570,
        "end_time": 391795
    },
    {
        "user": "Speaker 5",
        "text": "Yes.",
        "start_time": 391795,
        "end_time": 392295
    },
    {
        "user": "Speaker 1",
        "text": "And, not for nothing, but when Dan Bongino's complaining, you're probably doing something right. Notice too how he claims that this is the establishment conspiring against Lauren Boebert. Isn't it funny how the MAGA crowd only has one setting, victimhood? They're always the victims of some grand conspiracy against them. It's always the evil communist Marxist Democrats or the establishment or the deep state.",
        "start_time": 392720,
        "end_time": 414169
    },
    {
        "user": "Speaker 1",
        "text": "They've never done anything wrong. They've only ever been set up or frames or railroaded and they're always the victims and it's always someone else's fault. Tell you what, for a party that beats his chest as a bunch of alphas, they sure do sound like a bunch of whiny little bit. So in terms of whether Ken Buck's plan will work, who knows? I will say that with Trump effectively gutting the RNC and replacing dozens and dozens and dozens of employees with his own sycophants, I wouldn't be surprised if he found a way to intervene on behalf of one of his loyalists.",
        "start_time": 414229,
        "end_time": 442785
    },
    {
        "user": "Speaker 1",
        "text": "Because at the end of the day, as far as Republicans are concerned, it's not about democracy or the will of the people or representing their constituents. It is about Donald Trump. That is the one and only thing the GOP cares about. And if you need proof of that, look no further than Lauren Boebert herself. Before you go, I need some help.",
        "start_time": 443050,
        "end_time": 462790
    },
    {
        "user": "Speaker 1",
        "text": "Please subscribe to the channel and do your part to help grow the progressive media ecosystem. I don't do sponsorships or paid ads. I won't ask for money, but just subscribing to this channel goes a really long way, and it helps get the message out to more people. The subscribe button is right here on the screen. You can also subscribe to my Spanish language channel, which I made to reach those crucial Spanish speaking voters.",
        "start_time": 462790,
        "end_time": 481588
    },
    {
        "user": "Speaker 1",
        "text": "That link is on the screen too. And finally, if you wanna listen to my audio podcast, you can follow that link as well. Thanks so much for watching.",
        "start_time": 481588,
        "end_time": 488699
    }
]